# Pandas (Python Data Analysis Library)

__pandas__ is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language!!!

---

_"In the future, I think that programming languages are going to diminish in importance relative to data itself and common computational libraries"_

__Wes McKinney__ - Pandas Benevolent Dictator for Life

https://pandas.pydata.org/docs/reference/index.html

In [ ]:
#installation (https://pandas.pydata.org/docs/getting_started/install.html)

#!conda install pandas
#!conda install pandas=1.3.4

In [ ]:
%pip install pandas   # ionstalaria la ultima version
%pip install pandas=1.3.4

In [1]:
# import library and assign an alias

import pandas as pd

In [2]:
pd.__version__

'1.5.2'

---

### Pandas Data Structures

https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro

In [7]:
# Series

lst = [10,20,'a',40,50]

s1 = pd.Series(lst)

s1

0    10
1    20
2     a
3    40
4    50
dtype: object

In [5]:
lst

[1, 2, 3, 4, 5]

In [8]:
s1[0]

10

In [9]:
type(s1[0])

int

In [10]:
type(s1[2])

str

In [11]:
# atributos de las series

s1.index   # indice, nÂº de filas

RangeIndex(start=0, stop=5, step=1)

In [12]:
list(range(0, 5, 1))

[0, 1, 2, 3, 4]

In [13]:
s1.size   # 5 elementos

5

In [14]:
s1.shape     # 5 filas

(5,)

In [15]:
s1.ndim

1

In [17]:
s1.dtypes

dtype('O')

In [18]:
s1.describe()    # descripcion estadistica

count      5
unique     5
top       10
freq       1
dtype: int64

In [21]:
s2 = pd.Series([1,2,3,4,5])

s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
s2.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [23]:
s3 = pd.Series([1,2,3,4,5, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7,7 ])

s3

0     1
1     2
2     3
3     4
4     5
5     5
6     6
7     7
8     8
9     9
10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    7
dtype: int64

In [24]:
s3.head()   # por defecto los 5 primeros

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
s3.head(10)   # los 10 primeros

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [26]:
s3.tail()   # por defecto los 5 ultimos

14    4
15    5
16    6
17    7
18    7
dtype: int64

In [27]:
s3.tail(10)

9     9
10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    7
dtype: int64

In [28]:
'2024-01-31' > '2024-01-20'

True

In [32]:
'31-01-2024' > '31-02-2024'

False

__Pandas Data Types__

![Image](./img/etl_intro_pandas_01.PNG)

In [33]:
df = pd.DataFrame([1,2,3,4,5,6,7,8])

df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [34]:
s1

0    10
1    20
2     a
3    40
4    50
dtype: object

In [36]:
df.rename(columns={0: 'hola'})

   hola
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8

In [37]:
dictio = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['hola', 'adios', 'hasta luegui', 'hola']}

dictio

{'col1': [1, 2, 3, 4],
 'col2': [5, 6, 7, 8],
 'col3': ['hola', 'adios', 'hasta luegui', 'hola']}

In [38]:
df2 = pd.DataFrame(dictio)

df2

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [39]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [40]:
df2.index = ['a', 'b', 'c', 'd']

In [43]:
df2

   col1  col2          col3
a     1     5          hola
b     2     6         adios
c     3     7  hasta luegui
d     4     8          hola

In [42]:
df2.reset_index()

  index  col1  col2          col3
0     a     1     5          hola
1     b     2     6         adios
2     c     3     7  hasta luegui
3     d     4     8          hola

In [44]:
df2.reset_index(drop=True)  # drop=True no crea esa columna index

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [47]:
df2 = df2.reset_index(drop=True)

In [49]:
df2.reset_index(drop=True, inplace=True)  # inplace=True sobreescribe el df

In [50]:
df2

   col1  col2          col3
0     1     5          hola
1     2     6         adios
2     3     7  hasta luegui
3     4     8          hola

In [51]:
df2.size   # tiene 12 elementos

12

In [52]:
df2.shape     # 4 filas, 3 columnas

(4, 3)

In [53]:
df2.ndim

2

In [54]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [55]:
df2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 445.0 bytes

In [57]:
df2.describe().T  # por defecto solo lo numerico

      count  mean       std  min   25%  50%   75%  max
col1    4.0   2.5  1.290994  1.0  1.75  2.5  3.25  4.0
col2    4.0   6.5  1.290994  5.0  5.75  6.5  7.25  8.0

In [58]:
df2.describe(include='object').T  # por defecto solo lo numerico

     count unique   top freq
col3     4      3  hola    2

In [60]:
dictio = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['hola', 'hasta luegui', 'hasta luegui', 'hola']}

df3 = pd.DataFrame(dictio)

In [61]:
df3.describe(include='object').T   # la primera moda que se encuentra

     count unique   top freq
col3     4      2  hola    2

In [62]:
df3['col3']

0            hola
1    hasta luegui
2    hasta luegui
3            hola
Name: col3, dtype: object

In [63]:
df3['col3'].value_counts()

hola            2
hasta luegui    2
Name: col3, dtype: int64

In [65]:
df.head(3)

   0
0  1
1  2
2  3

In [66]:
df.tail(3)

   0
5  6
6  7
7  8

In [68]:
df2.head(2)

   col1  col2   col3
0     1     5   hola
1     2     6  adios

In [69]:
df2.tail(2)

   col1  col2          col3
2     3     7  hasta luegui
3     4     8          hola

---

In [ ]:
# Pandas exploration methods => .loc[], .iloc[]

More about `.loc[]` and `.iloc[]`: https://towardsdatascience.com/how-to-use-loc-and-iloc-for-selecting-data-in-pandas-bd09cb4c3d79

---

In [ ]:
# Pandas MORE exploration methods I

---

In [ ]:
# Pandas MORE exploration methods II

In [ ]:
# Value counts

In [ ]:
# Unique values

In [ ]:
# Sorted values

---

__To be continued...__